import {
    faBook,
    faEllipsisH, faGear,
    faHouse, faInfoCircle,
    faPlusCircle,
    faTableList,
    faUser,
    faUtensils
} from "@fortawesome/free-solid-svg-icons";

export const MOCKED_MENU = [
    {
        "day": 1,
        "meals": [
            {
                "fat": 6,
                "type": "breakfast",
                "carbs": 68,
                "title": "Овсянка с яблочными дольками",
                "recipe": {
                    "steps": [
                        "Насыпьте овсяные хлопья в кастрюлю.",
                        "Добавьте молоко и ставьте на медленный огонь.",
                        "Когда овсянка начнет закипать, убавьте огонь и варите, помешивая, около 5 минут.",
                        "Пока овсянка варится, нарежьте яблоко на маленькие дольки.",
                        "Добавьте сахар и корицу к яблокам и перемешайте.",
                        "Добавьте яблоки с сахаром и корицей в готовую овсянку и перемешайте.",
                        "Дайте овсянке настояться под крышкой 2-3 минуты перед подачей."
                    ],
                    "ingredients": [
                        {
                            "item": "Овсяные хлопья",
                            "amount": "50 г"
                        },
                        {
                            "item": "Молоко",
                            "amount": "200 г"
                        },
                        {
                            "item": "Яблоко",
                            "amount": "100 г"
                        },
                        {
                            "item": "Сахар",
                            "amount": "10 г"
                        },
                        {
                            "item": "Корица",
                            "amount": "2 г"
                        }
                    ]
                },
                "protein": 16,
                "calories": 374
            },
            {
                "fat": 15,
                "type": "snack",
                "carbs": 7,
                "title": "Миндальные орехи",
                "recipe": {
                    "steps": [
                        "Промыть миндаль под проточной водой.",
                        "Замочить миндаль в теплой воде на 8 часов.",
                        "Слить воду и подсушить миндаль на полотенце.",
                        "Обжарить миндаль на сухой сковороде до золотистого цвета, периодически помешивая."
                    ],
                    "ingredients": [
                        {
                            "item": "Миндаль",
                            "amount": "31 г"
                        }
                    ]
                },
                "protein": 7,
                "calories": 180
            },
            {
                "fat": 23,
                "type": "lunch",
                "carbs": 40,
                "title": "Куриное филе на гриле с киноа",
                "recipe": {
                    "steps": [
                        "Промойте киноа под проточной водой, затем варите в двойном объеме воды до готовности, около 15-20 минут.",
                        "Маринуйте куриное филе в смеси оливкового масла, сока лимона, измельченного чеснока, соли и перца в течение 20 минут.",
                        "Разогрейте гриль до средней температуры и готовьте куриное филе до золотистой корочки и полной готовности, примерно по 6-7 минут с каждой стороны.",
                        "Смешайте готовое киноа с мелко нарезанными свежими травами, дополнительно можно добавить оливковое масло и специи по вкусу.",
                        "Подавайте куриное филе на подушке из ароматного киноа."
                    ],
                    "ingredients": [
                        {
                            "item": "Куриное филе",
                            "amount": "107 г"
                        },
                        {
                            "item": "Киноа",
                            "amount": "54 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "16 г"
                        },
                        {
                            "item": "Лимон",
                            "amount": "27 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "3 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "1 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "5 г"
                        },
                        {
                            "item": "Свежие травы (например, петрушка или базилик)",
                            "amount": "11 г"
                        }
                    ]
                },
                "protein": 42,
                "calories": 540
            },
            {
                "fat": 9,
                "type": "afternoon_snack",
                "carbs": 21,
                "title": "Сельдерей с цельнозерновым хумусом",
                "recipe": {
                    "steps": [
                        "Замочить нут на ночь в воде, затем сварить до готовности.",
                        "Смешать в блендере вареный нут, тахини, лимонный сок, чеснок, оливковое масло, кумин, паприку, соль и воду до однородной массы.",
                        "Очистить сельдерей и нарезать его на полоски.",
                        "Подавать хумус с нарезанным сельдереем."
                    ],
                    "ingredients": [
                        {
                            "item": "Сельдерей",
                            "amount": "37 г"
                        },
                        {
                            "item": "Нут",
                            "amount": "28 г"
                        },
                        {
                            "item": "Тахини (кунжутная паста)",
                            "amount": "6 г"
                        },
                        {
                            "item": "Лимонный сок",
                            "amount": "4 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "2 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "4 г"
                        },
                        {
                            "item": "Кумин (зира)",
                            "amount": "1 г"
                        },
                        {
                            "item": "Паприка",
                            "amount": "1 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "1 г"
                        },
                        {
                            "item": "Вода",
                            "amount": "9 г"
                        }
                    ]
                },
                "protein": 7,
                "calories": 180
            },
            {
                "fat": 30,
                "type": "dinner",
                "carbs": 11,
                "title": "Лосось запеченный с брокколи",
                "recipe": {
                    "steps": [
                        "Подготовьте ингредиенты: промойте лосось и брокколи, нарежьте лосось на порции, брокколи разделите на соцветия.",
                        "Заправьте лосось солью, перцем, соком лимона и оливковым маслом. Оставьте мариноваться на 15 минут.",
                        "Выложите брокколи и лосось на противень, предварительно смазанный маслом или застеленный пергаментом.",
                        "Разогрейте духовку до 200 градусов Цельсия и запекайте блюдо 20 минут.",
                        "Подавайте сразу после приготовления, украсив дольками лимона и посыпав измельченным чесноком."
                    ],
                    "ingredients": [
                        {
                            "item": "Лосось",
                            "amount": "145 г"
                        },
                        {
                            "item": "Брокколи",
                            "amount": "109 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "11 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "2 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "1 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "5 г"
                        },
                        {
                            "item": "Лимон",
                            "amount": "18 г"
                        }
                    ]
                },
                "protein": 33,
                "calories": 450
            }
        ],
        "total": {
            "fat": 83,
            "carbs": 147,
            "protein": 105,
            "calories": 1724
        }
    },
    {
        "day": 2,
        "meals": [
            {
                "fat": 28,
                "type": "breakfast",
                "carbs": 38,
                "title": "Яйца пашот с авокадо на тосте",
                "recipe": {
                    "steps": [
                        "Подготовить все ингредиенты. Хлеб поджарить в тостере до золотистой корочки.",
                        "Авокадо разрезать пополам, удалить косточку, вынуть мякоть и размять вилкой, приправить солью и перцем.",
                        "Варить яйца пашот: в кастрюлю налить воду, добавить уксус и довести до кипения. Варить яйца 3-4 минуты.",
                        "На тосты выложить авокадо, сверху аккуратно разместить яйца пашот. Подавать немедленно."
                    ],
                    "ingredients": [
                        {
                            "item": "Яйца",
                            "amount": "65 г"
                        },
                        {
                            "item": "Авокадо",
                            "amount": "131 г"
                        },
                        {
                            "item": "Хлеб для тостов",
                            "amount": "52 г"
                        },
                        {
                            "item": "Уксус",
                            "amount": "7 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "3 г"
                        },
                        {
                            "item": "Перец",
                            "amount": "1 г"
                        }
                    ]
                },
                "protein": 16,
                "calories": 450
            },
            {
                "fat": 4,
                "type": "snack",
                "carbs": 21,
                "title": "Кефир",
                "recipe": {
                    "steps": [
                        "Подогрейте молоко до 40-45 градусов Цельсия.",
                        "Добавьте закваску, тщательно перемешайте и оставьте в теплом месте на 12-18 часов."
                    ],
                    "ingredients": [
                        {
                            "item": "Молоко",
                            "amount": "427 г"
                        },
                        {
                            "item": "Закваска для кефира",
                            "amount": "2 г"
                        }
                    ]
                },
                "protein": 15,
                "calories": 180
            },
            {
                "fat": 18,
                "type": "lunch",
                "carbs": 48,
                "title": "Турецкий лепеш с курицей и овощами",
                "recipe": {
                    "steps": [
                        "Подготовьте маринад для курицы, смешав йогурт, лимонный сок, измельченный чеснок, соль, перец и паприку.",
                        "Замаринуйте куриное филе в полученной смеси и оставьте на 1 час.",
                        "Обжарьте курицу на сковороде с оливковым маслом до готовности.",
                        "Нарежьте помидоры, огурцы и лук.",
                        "Смешайте овощи, добавьте к ним листья салата.",
                        "Разогрейте лаваш на сковороде и уложите на него овощную смесь, затем добавьте курицу.",
                        "Заверните лаваш с начинкой и подавайте."
                    ],
                    "ingredients": [
                        {
                            "item": "Куриное филе",
                            "amount": "119 г"
                        },
                        {
                            "item": "Лаваш",
                            "amount": "79 г"
                        },
                        {
                            "item": "Помидоры",
                            "amount": "40 г"
                        },
                        {
                            "item": "Огурцы",
                            "amount": "40 г"
                        },
                        {
                            "item": "Листья салата",
                            "amount": "20 г"
                        },
                        {
                            "item": "Красный лук",
                            "amount": "20 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "4 г"
                        },
                        {
                            "item": "Йогурт",
                            "amount": "40 г"
                        },
                        {
                            "item": "Лимонный сок",
                            "amount": "8 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "12 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "2 г"
                        },
                        {
                            "item": "Перец",
                            "amount": "2 г"
                        },
                        {
                            "item": "Паприка",
                            "amount": "2 г"
                        }
                    ]
                },
                "protein": 46,
                "calories": 540
            },
            {
                "fat": 0,
                "type": "afternoon_snack",
                "carbs": 28,
                "title": "Яблоко",
                "recipe": {
                    "steps": [
                        "Выберите спелое яблоко.",
                        "Промойте под чистой водой."
                    ],
                    "ingredients": [
                        {
                            "item": "Яблоко",
                            "amount": "200 г"
                        }
                    ]
                },
                "protein": 1,
                "calories": 104
            },
            {
                "fat": 26,
                "type": "dinner",
                "carbs": 24,
                "title": "Телятина запеченная с овощами",
                "recipe": {
                    "steps": [
                        "Подготовить все ингредиенты: мясо нарезать крупными кусками, овощи очистить и нарезать.",
                        "Телятину промариновать с солью, перцем, розмарином и оливковым маслом.",
                        "На дно формы для запекания выложить лук, морковь, чеснок и картофель, сверху разместить маринованное мясо.",
                        "Запекать в предварительно разогретой до 180 градусов духовке около 1 часа до готовности."
                    ],
                    "ingredients": [
                        {
                            "item": "Телятина",
                            "amount": "140 г"
                        },
                        {
                            "item": "Картофель",
                            "amount": "84 г"
                        },
                        {
                            "item": "Морковь",
                            "amount": "42 г"
                        },
                        {
                            "item": "Лук",
                            "amount": "28 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "6 г"
                        },
                        {
                            "item": "Розмарин",
                            "amount": "1 г"
                        },
                        {
                            "item": "Тимьян",
                            "amount": "1 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "8 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "3 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "1 г"
                        }
                    ]
                },
                "protein": 31,
                "calories": 450
            }
        ],
        "total": {
            "fat": 76,
            "carbs": 159,
            "protein": 109,
            "calories": 1724
        }
    },
    {
        "day": 3,
        "meals": [
            {
                "fat": 2,
                "type": "breakfast",
                "carbs": 48,
                "title": "Смузи из шпината, банана и ягод",
                "recipe": {
                    "steps": [
                        "Поместите шпинат, порезанный банан и ягоды в блендер.",
                        "Добавьте воду или молоко.",
                        "Взбейте до однородной консистенции.",
                        "Перелейте смузи в стакан и подавайте."
                    ],
                    "ingredients": [
                        {
                            "item": "шпинат",
                            "amount": "30 г"
                        },
                        {
                            "item": "банан",
                            "amount": "150 г"
                        },
                        {
                            "item": "ягоды (например, клубника)",
                            "amount": "100 г"
                        },
                        {
                            "item": "вода или молоко",
                            "amount": "100 мл"
                        }
                    ]
                },
                "protein": 7,
                "calories": 214
            },
            {
                "fat": 18,
                "type": "snack",
                "carbs": 4,
                "title": "Грецкие орехи",
                "recipe": {
                    "steps": [
                        "Купить грецкие орехи.",
                        "Разложить орехи на тарелку."
                    ],
                    "ingredients": [
                        {
                            "item": "Грецкие орехи",
                            "amount": "28 г"
                        }
                    ]
                },
                "protein": 4,
                "calories": 180
            },
            {
                "fat": 27,
                "type": "lunch",
                "carbs": 27,
                "title": "Цезарь с курицей",
                "recipe": {
                    "steps": [
                        "Подготовить все ингредиенты. Куриное филе отварить и нарезать полосками. Хлеб нарезать кубиками и подсушить в духовке или на сковороде до хрустящей корочки.",
                        "Измельчить чеснок, смешать с оливковым маслом, лимонным соком, яйцом, горчицей, анчоусами и вустерширским соусом для приготовления дрессинга.",
                        "На тарелке выложить листья салата ромен, сверху разместить курицу, гренки и полить все подготовленным дрессингом.",
                        "Посыпать блюдо тертым сыром пармезан."
                    ],
                    "ingredients": [
                        {
                            "item": "Куриное филе",
                            "amount": "87 г"
                        },
                        {
                            "item": "Хлеб белый",
                            "amount": "44 г"
                        },
                        {
                            "item": "Салат ромен",
                            "amount": "65 г"
                        },
                        {
                            "item": "Пармезан",
                            "amount": "22 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "4 г"
                        },
                        {
                            "item": "Яйцо куриное",
                            "amount": "22 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "13 г"
                        },
                        {
                            "item": "Лимонный сок",
                            "amount": "4 г"
                        },
                        {
                            "item": "Горчица",
                            "amount": "4 г"
                        },
                        {
                            "item": "Анчоусы",
                            "amount": "9 г"
                        },
                        {
                            "item": "Вустерширский соус",
                            "amount": "2 г"
                        }
                    ]
                },
                "protein": 45,
                "calories": 540
            },
            {
                "fat": 11,
                "type": "afternoon_snack",
                "carbs": 15,
                "title": "Морковь с нежирным йогуртом",
                "recipe": {
                    "steps": [
                        "Очистить морковь и натереть на терке.",
                        "Смешать йогурт, измельченный чеснок, лимонный сок, оливковое масло, соль и перец в миске.",
                        "Добавить натертую морковь к йогуртовой смеси и тщательно перемешать.",
                        "Подавать, украсив зеленью."
                    ],
                    "ingredients": [
                        {
                            "item": "Морковь",
                            "amount": "109 г"
                        },
                        {
                            "item": "Нежирный йогурт",
                            "amount": "54 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "4 г"
                        },
                        {
                            "item": "Лимонный сок",
                            "amount": "7 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "11 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "2 г"
                        },
                        {
                            "item": "Черный перец",
                            "amount": "1 г"
                        },
                        {
                            "item": "Зелень (по желанию)",
                            "amount": "4 г"
                        }
                    ]
                },
                "protein": 7,
                "calories": 180
            },
            {
                "fat": 27,
                "type": "dinner",
                "carbs": 11,
                "title": "Форель на пару с овощным салатом",
                "recipe": {
                    "steps": [
                        "Очистите и нарежьте овощи для салата: морковь, огурец, помидоры и листья салата.",
                        "Смешайте нарезанные овощи, добавьте оливковое масло, соль и перец по вкусу.",
                        "Подготовьте форель: удалите внутренности, промойте и нарежьте на порции.",
                        "Посолите и поперчите порции форели, добавьте лимонный сок.",
                        "Приготовьте форель на пару в течение 10-15 минут до готовности.",
                        "Сервируйте готовую форель с овощным салатом."
                    ],
                    "ingredients": [
                        {
                            "item": "Форель",
                            "amount": "189 г"
                        },
                        {
                            "item": "Морковь",
                            "amount": "47 г"
                        },
                        {
                            "item": "Огурец",
                            "amount": "47 г"
                        },
                        {
                            "item": "Помидоры",
                            "amount": "47 г"
                        },
                        {
                            "item": "Листья салата",
                            "amount": "24 г"
                        },
                        {
                            "item": "Лимон",
                            "amount": "24 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "14 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "2 г"
                        },
                        {
                            "item": "Перец",
                            "amount": "2 г"
                        }
                    ]
                },
                "protein": 41,
                "calories": 450
            }
        ],
        "total": {
            "fat": 85,
            "carbs": 105,
            "protein": 104,
            "calories": 1564
        }
    },
    {
        "day": 4,
        "meals": [
            {
                "fat": 21,
                "type": "breakfast",
                "carbs": 42,
                "title": "Творожная запеканка с ягодами",
                "recipe": {
                    "steps": [
                        "Взбейте яйца с сахаром и ванильным сахаром до пышности.",
                        "Добавьте творог, сметану и перемешайте до однородности.",
                        "Смешайте муку с разрыхлителем и просейте в творожную массу, аккуратно перемешайте.",
                        "Добавьте ягоды и аккуратно перемешайте, чтобы ягоды равномерно распределились по массе.",
                        "Выложите массу в смазанную маслом форму и разровняйте поверхность.",
                        "Запекайте в предварительно разогретой до 180 градусов Цельсия духовке около 50 минут.",
                        "Дайте запеканке остыть перед подачей."
                    ],
                    "ingredients": [
                        {
                            "item": "Творог",
                            "amount": "109 г"
                        },
                        {
                            "item": "Яйцо",
                            "amount": "22 г"
                        },
                        {
                            "item": "Сахар",
                            "amount": "22 г"
                        },
                        {
                            "item": "Мука",
                            "amount": "11 г"
                        },
                        {
                            "item": "Ванильный сахар",
                            "amount": "2 г"
                        },
                        {
                            "item": "Разрыхлитель",
                            "amount": "1 г"
                        },
                        {
                            "item": "Сметана",
                            "amount": "43 г"
                        },
                        {
                            "item": "Смесь ягод (замороженные или свежие)",
                            "amount": "43 г"
                        }
                    ]
                },
                "protein": 25,
                "calories": 450
            },
            {
                "fat": 0,
                "type": "snack",
                "carbs": 34,
                "title": "Банан",
                "recipe": {
                    "steps": [
                        "Выбрать спелый банан",
                        "Почистить банан от кожуры"
                    ],
                    "ingredients": [
                        {
                            "item": "Банан",
                            "amount": "150 г"
                        }
                    ]
                },
                "protein": 2,
                "calories": 134
            },
            {
                "fat": 32,
                "type": "lunch",
                "carbs": 33,
                "title": "Бефстроганов с гречкой",
                "recipe": {
                    "steps": [
                        "Нарезать говядину тонкими полосками, посолить и поперчить.",
                        "Обвалять мясные полоски в муке.",
                        "На сковороде разогреть растительное масло и обжарить лук до золотистости, затем добавить мясо и обжарить до готовности.",
                        "Добавить горчицу и говяжий бульон, тушить под крышкой на медленном огне 10 минут.",
                        "Добавить сметану, перемешать и тушить еще 5 минут.",
                        "Отдельно сварить гречку в подсоленной воде до готовности, в конце добавить сливочное масло."
                    ],
                    "ingredients": [
                        {
                            "item": "Говядина",
                            "amount": "89 г"
                        },
                        {
                            "item": "Лук репчатый",
                            "amount": "18 г"
                        },
                        {
                            "item": "Мука пшеничная",
                            "amount": "5 г"
                        },
                        {
                            "item": "Сметана",
                            "amount": "35 г"
                        },
                        {
                            "item": "Масло растительное",
                            "amount": "5 г"
                        },
                        {
                            "item": "Бульон говяжий",
                            "amount": "44 г"
                        },
                        {
                            "item": "Горчица",
                            "amount": "2 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "1 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "1 г"
                        },
                        {
                            "item": "Гречневая крупа",
                            "amount": "35 г"
                        },
                        {
                            "item": "Масло сливочное",
                            "amount": "5 г"
                        },
                        {
                            "item": "Вода",
                            "amount": "71 г"
                        }
                    ]
                },
                "protein": 31,
                "calories": 540
            },
            {
                "fat": 4,
                "type": "afternoon_snack",
                "carbs": 39,
                "title": "Микс из сухофруктов",
                "recipe": {
                    "steps": [
                        "Промойте все сухофрукты под проточной водой.",
                        "Замочите сухофрукты в теплой воде на 1-2 часа, затем слейте воду.",
                        "Измельчите орехи и добавьте к сухофруктам.",
                        "Тщательно перемешайте все ингредиенты."
                    ],
                    "ingredients": [
                        {
                            "item": "Изюм",
                            "amount": "13 г"
                        },
                        {
                            "item": "Курага",
                            "amount": "13 г"
                        },
                        {
                            "item": "Финики",
                            "amount": "13 г"
                        },
                        {
                            "item": "Чернослив",
                            "amount": "13 г"
                        },
                        {
                            "item": "Орехи",
                            "amount": "7 г"
                        }
                    ]
                },
                "protein": 2,
                "calories": 180
            },
            {
                "fat": 28,
                "type": "dinner",
                "carbs": 18,
                "title": "Котлеты из индейки с салатом из свежих овощей",
                "recipe": {
                    "steps": [
                        "Измельчить лук и чеснок, добавить в фарш.",
                        "В фарш добавить яйцо, сухари, соль и перец, тщательно перемешать.",
                        "Сформировать котлеты и обжарить на растительном масле до золотистой корочки.",
                        "Помыть и нарезать овощи для салата (помидоры, огурцы).",
                        "Смешать овощи с нарезанными салатными листьями, заправить лимонным соком и оливковым маслом, посолить и поперчить."
                    ],
                    "ingredients": [
                        {
                            "item": "Фарш индейки",
                            "amount": "125 г"
                        },
                        {
                            "item": "Лук репчатый",
                            "amount": "25 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "5 г"
                        },
                        {
                            "item": "Яйцо куриное",
                            "amount": "12 г"
                        },
                        {
                            "item": "Сухари панировочные",
                            "amount": "12 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "1 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "0 г"
                        },
                        {
                            "item": "Масло растительное",
                            "amount": "7 г"
                        },
                        {
                            "item": "Помидоры",
                            "amount": "50 г"
                        },
                        {
                            "item": "Огурцы",
                            "amount": "50 г"
                        },
                        {
                            "item": "Салатные листья",
                            "amount": "12 г"
                        },
                        {
                            "item": "Лимонный сок",
                            "amount": "2 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "5 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "0 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "0 г"
                        }
                    ]
                },
                "protein": 32,
                "calories": 450
            }
        ],
        "total": {
            "fat": 85,
            "carbs": 166,
            "protein": 92,
            "calories": 1754
        }
    },
    {
        "day": 5,
        "meals": [
            {
                "fat": 18,
                "type": "breakfast",
                "carbs": 59,
                "title": "Каша из киноа с медом и орехами",
                "recipe": {
                    "steps": [
                        "Промойте киноа под холодной водой и слейте.",
                        "Доведите воду до кипения, добавьте киноа и варите на медленном огне под крышкой 15 минут.",
                        "Добавьте мед и перемешайте.",
                        "Посыпьте орехами перед подачей."
                    ],
                    "ingredients": [
                        {
                            "item": "Киноа",
                            "amount": "59 г"
                        },
                        {
                            "item": "Мед",
                            "amount": "18 г"
                        },
                        {
                            "item": "Орехи",
                            "amount": "30 г"
                        },
                        {
                            "item": "Вода",
                            "amount": "119 мл"
                        }
                    ]
                },
                "protein": 13,
                "calories": 450
            },
            {
                "fat": 7,
                "type": "snack",
                "carbs": 18,
                "title": "Творог с ягодами",
                "recipe": {
                    "steps": [
                        "Размять творог в глубокой тарелке до однородной консистенции.",
                        "Добавить мед и перемешать.",
                        "Вымыть ягоды, добавить к творогу и аккуратно перемешать."
                    ],
                    "ingredients": [
                        {
                            "item": "Творог",
                            "amount": "74 г"
                        },
                        {
                            "item": "Смешанные ягоды (клубника, черника, малина)",
                            "amount": "55 г"
                        },
                        {
                            "item": "Мед",
                            "amount": "11 г"
                        }
                    ]
                },
                "protein": 14,
                "calories": 180
            },
            {
                "fat": 22,
                "type": "lunch",
                "carbs": 67,
                "title": "Суп-пюре из тыквы с кусочками цельнозернового хлеба",
                "recipe": {
                    "steps": [
                        "Очистить и нарезать тыкву, картофель, морковь и лук.",
                        "На разогретой сковороде с оливковым маслом обжарить лук до прозрачности, добавить чеснок на последние минуты.",
                        "В кастрюлю добавить обжаренный лук с чесноком, нарезанную тыкву, картофель и морковь, залить бульоном и довести до кипения.",
                        "Варить на среднем огне до мягкости овощей, около 20-30 минут.",
                        "Измельчить суп до состояния пюре при помощи блендера.",
                        "Добавить сливки, соль и перец, довести до кипения и снять с огня.",
                        "Подавать суп с кусочками цельнозернового хлеба."
                    ],
                    "ingredients": [
                        {
                            "item": "Тыква",
                            "amount": "177 г"
                        },
                        {
                            "item": "Картофель",
                            "amount": "71 г"
                        },
                        {
                            "item": "Морковь",
                            "amount": "35 г"
                        },
                        {
                            "item": "Лук",
                            "amount": "35 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "7 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "11 г"
                        },
                        {
                            "item": "Сливки 20%",
                            "amount": "35 г"
                        },
                        {
                            "item": "Бульон (овощной или куриный)",
                            "amount": "355 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "4 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "2 г"
                        },
                        {
                            "item": "Цельнозерновой хлеб",
                            "amount": "71 г"
                        }
                    ]
                },
                "protein": 22,
                "calories": 540
            },
            {
                "fat": 11,
                "type": "afternoon_snack",
                "carbs": 10,
                "title": "Огурцы с греческим йогуртом",
                "recipe": {
                    "steps": [
                        "Огурцы вымыть, очистить и натереть на крупной терке.",
                        "Чеснок очистить и мелко нарезать или пропустить через пресс.",
                        "Укроп вымыть, мелко нарезать.",
                        "В миске смешать греческий йогурт, оливковое масло, соль, чеснок и укроп.",
                        "Добавить натертые огурцы к смеси йогурта, тщательно перемешать.",
                        "Поставить в холодильник на 30 минут перед подачей."
                    ],
                    "ingredients": [
                        {
                            "item": "Огурцы",
                            "amount": "151 г"
                        },
                        {
                            "item": "Греческий йогурт",
                            "amount": "101 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "5 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "3 г"
                        },
                        {
                            "item": "Укроп",
                            "amount": "8 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "10 г"
                        }
                    ]
                },
                "protein": 12,
                "calories": 180
            },
            {
                "fat": 25,
                "type": "dinner",
                "carbs": 54,
                "title": "Рататуй",
                "recipe": {
                    "steps": [
                        "Подготовьте овощи: нарежьте баклажаны, цуккини, перцы, лук, чеснок и помидоры на тонкие кружочки.",
                        "На дно формы для запекания выложите лук и чеснок, сверху разложите кружочки овощей в чередующемся порядке (баклажан, цуккини, перец, помидор).",
                        "Посыпьте овощи солью, перцем и тимьяном, затем равномерно полейте оливковым маслом.",
                        "Закройте форму фольгой и запекайте в предварительно разогретой до 190°C духовке около 40 минут.",
                        "Уберите фольгу и запекайте еще около 20 минут до золотистой корки."
                    ],
                    "ingredients": [
                        {
                            "item": "Баклажан",
                            "amount": "228 г"
                        },
                        {
                            "item": "Цуккини",
                            "amount": "228 г"
                        },
                        {
                            "item": "Красный перец",
                            "amount": "114 г"
                        },
                        {
                            "item": "Желтый перец",
                            "amount": "114 г"
                        },
                        {
                            "item": "Помидоры",
                            "amount": "228 г"
                        },
                        {
                            "item": "Лук",
                            "amount": "76 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "8 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "23 г"
                        },
                        {
                            "item": "Свежий тимьян",
                            "amount": "4 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "4 г"
                        },
                        {
                            "item": "Перец",
                            "amount": "2 г"
                        }
                    ]
                },
                "protein": 12,
                "calories": 450
            }
        ],
        "total": {
            "fat": 83,
            "carbs": 208,
            "protein": 73,
            "calories": 1800
        }
    },
    {
        "day": 6,
        "meals": [
            {
                "fat": 39,
                "type": "breakfast",
                "carbs": 6,
                "title": "Яичница с помидорами и базиликом",
                "recipe": {
                    "steps": [
                        "Разогреть сковороду, добавить оливковое масло.",
                        "Вымыть и нарезать помидоры, обжарить их на сковороде в течение 2 минут.",
                        "Добавить яйца, взбитые с солью.",
                        "Готовить на среднем огне до желаемой степени готовности яиц.",
                        "Посыпать сверху мелко нарезанным базиликом."
                    ],
                    "ingredients": [
                        {
                            "item": "Яйца",
                            "amount": "149 г"
                        },
                        {
                            "item": "Помидоры",
                            "amount": "112 г"
                        },
                        {
                            "item": "Базилик",
                            "amount": "7 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "4 г"
                        },
                        {
                            "item": "Масло оливковое",
                            "amount": "22 г"
                        }
                    ]
                },
                "protein": 21,
                "calories": 450
            },
            {
                "fat": 16,
                "type": "snack",
                "carbs": 7,
                "title": "Смешанные орехи",
                "recipe": {
                    "steps": [
                        "Тщательно промойте все орехи.",
                        "Разложите орехи на противень и обжарьте в духовке при 180 градусах Цельсия в течение 10-15 минут.",
                        "Дайте орехам остыть и смешайте их в большой миске."
                    ],
                    "ingredients": [
                        {
                            "item": "Грецкие орехи",
                            "amount": "8 г"
                        },
                        {
                            "item": "Миндаль",
                            "amount": "8 г"
                        },
                        {
                            "item": "Фисташки",
                            "amount": "8 г"
                        },
                        {
                            "item": "Кешью",
                            "amount": "8 г"
                        }
                    ]
                },
                "protein": 6,
                "calories": 180
            },
            {
                "fat": 27,
                "type": "lunch",
                "carbs": 28,
                "title": "Уха из семги",
                "recipe": {
                    "steps": [
                        "Очистите и нарежьте картофель, лук и морковь.",
                        "Залейте воду в кастрюлю, доведите до кипения и добавьте подготовленные овощи, лавровый лист и перец горошком.",
                        "Варите на медленном огне 20 минут.",
                        "Добавьте куски семги и варите еще 15 минут.",
                        "Посолите по вкусу и добавьте укроп перед подачей."
                    ],
                    "ingredients": [
                        {
                            "item": "Семга",
                            "amount": "198 г"
                        },
                        {
                            "item": "Картофель",
                            "amount": "119 г"
                        },
                        {
                            "item": "Лук репчатый",
                            "amount": "40 г"
                        },
                        {
                            "item": "Морковь",
                            "amount": "40 г"
                        },
                        {
                            "item": "Вода",
                            "amount": "790 г"
                        },
                        {
                            "item": "Лавровый лист",
                            "amount": "0 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "4 г"
                        },
                        {
                            "item": "Перец черный горошком",
                            "amount": "1 г"
                        },
                        {
                            "item": "Укроп",
                            "amount": "4 г"
                        }
                    ]
                },
                "protein": 44,
                "calories": 540
            },
            {
                "fat": 0,
                "type": "afternoon_snack",
                "carbs": 31,
                "title": "Груша",
                "recipe": {
                    "steps": [
                        "Вымыть грушу.",
                        "Подать на стол."
                    ],
                    "ingredients": [
                        {
                            "item": "Груша",
                            "amount": "200 г"
                        }
                    ]
                },
                "protein": 1,
                "calories": 114
            },
            {
                "fat": 21,
                "type": "dinner",
                "carbs": 58,
                "title": "Паста с овощами и оливковым маслом",
                "recipe": {
                    "steps": [
                        "Приготовьте все овощи: почистите и нарежьте кабачок, морковь и баклажаны на небольшие кусочки.",
                        "Измельчите чеснок и петрушку.",
                        "Отварите спагетти до состояния 'аль денте', затем откиньте на дуршлаг.",
                        "На сковороде разогрейте оливковое масло, добавьте чеснок и прогрейте до золотистого цвета.",
                        "Добавьте овощи на сковороду, жарьте на среднем огне до мягкости, приправьте солью и перцем.",
                        "Добавьте спагетти к овощам, перемешайте и жарьте все вместе еще около 1-2 минут.",
                        "Перед подачей посыпьте блюдо измельченной петрушкой."
                    ],
                    "ingredients": [
                        {
                            "item": "спагетти",
                            "amount": "127 г"
                        },
                        {
                            "item": "кабачок",
                            "amount": "64 г"
                        },
                        {
                            "item": "морковь",
                            "amount": "64 г"
                        },
                        {
                            "item": "баклажан",
                            "amount": "64 г"
                        },
                        {
                            "item": "чеснок",
                            "amount": "13 г"
                        },
                        {
                            "item": "оливковое масло",
                            "amount": "19 г"
                        },
                        {
                            "item": "соль",
                            "amount": "3 г"
                        },
                        {
                            "item": "перец черный молотый",
                            "amount": "1 г"
                        },
                        {
                            "item": "петрушка",
                            "amount": "6 г"
                        }
                    ]
                },
                "protein": 11,
                "calories": 450
            }
        ],
        "total": {
            "fat": 103,
            "carbs": 130,
            "protein": 83,
            "calories": 1734
        }
    },
    {
        "day": 7,
        "meals": [
            {
                "fat": 37,
                "type": "breakfast",
                "carbs": 5,
                "title": "Омлет с шампиньонами и зеленью",
                "recipe": {
                    "steps": [
                        "Подготовить все ингредиенты. Шампиньоны почистить и нарезать тонкими пластинками. Зелень мелко нарезать.",
                        "На сковороде растопить сливочное масло и обжарить шампиньоны до золотистой корочки.",
                        "В миске взбить яйца с молоком, солью и перцем.",
                        "Добавить к яицам обжаренные шампиньоны и зелень, перемешать.",
                        "Вылить смесь на сковороду и готовить омлет на среднем огне до готовности, периодически помешивая."
                    ],
                    "ingredients": [
                        {
                            "item": "Яйца",
                            "amount": "153 г"
                        },
                        {
                            "item": "Шампиньоны",
                            "amount": "115 г"
                        },
                        {
                            "item": "Сливочное масло",
                            "amount": "23 г"
                        },
                        {
                            "item": "Молоко",
                            "amount": "38 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "4 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "2 г"
                        },
                        {
                            "item": "Зелень (укроп или петрушка)",
                            "amount": "15 г"
                        }
                    ]
                },
                "protein": 26,
                "calories": 450
            },
            {
                "fat": 8,
                "type": "snack",
                "carbs": 19,
                "title": "Сырники с сухофруктами",
                "recipe": {
                    "steps": [
                        "Смешать творог с яйцами, сахаром и солью до однородной массы.",
                        "Добавить муку с разрыхлителем, затем нарезанные небольшими кусочками сухофрукты.",
                        "Замесить тесто и сформировать из него небольшие круглые лепешки.",
                        "Обжарить сырники на сковороде с растительным маслом с обеих сторон до золотистой корочки."
                    ],
                    "ingredients": [
                        {
                            "item": "Творог",
                            "amount": "46 г"
                        },
                        {
                            "item": "Яйцо",
                            "amount": "5 г"
                        },
                        {
                            "item": "Сахар",
                            "amount": "5 г"
                        },
                        {
                            "item": "Мука",
                            "amount": "9 г"
                        },
                        {
                            "item": "Разрыхлитель",
                            "amount": "0 г"
                        },
                        {
                            "item": "Сухофрукты (изюм, курага, чернослив)",
                            "amount": "9 г"
                        },
                        {
                            "item": "Растительное масло",
                            "amount": "3 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "0 г"
                        }
                    ]
                },
                "protein": 10,
                "calories": 180
            },
            {
                "fat": 38,
                "type": "lunch",
                "carbs": 25,
                "title": "Стейк из лосося с картофелем фри",
                "recipe": {
                    "steps": [
                        "Нарезать картофель полосками и обжарить в растительном масле до золотистой корочки.",
                        "Посолить и поперчить стейк из лосося.",
                        "Обжарить стейк из лосося на среднем огне до желаемой степени готовности.",
                        "Подавать стейк с картофелем фри."
                    ],
                    "ingredients": [
                        {
                            "item": "Стейк из лосося",
                            "amount": "99 г"
                        },
                        {
                            "item": "Картофель",
                            "amount": "148 г"
                        },
                        {
                            "item": "Масло растительное",
                            "amount": "25 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "2 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "1 г"
                        }
                    ]
                },
                "protein": 25,
                "calories": 540
            },
            {
                "fat": 15,
                "type": "afternoon_snack",
                "carbs": 5,
                "title": "Огурцы и помидоры с брынзой",
                "recipe": {
                    "steps": [
                        "Помыть огурцы и помидоры, нарезать их кружочками.",
                        "Нарезать брынзу кубиками.",
                        "Смешать в салатнике огурцы, помидоры и брынзу.",
                        "Посыпать салат измельченным базиликом, добавить соль и перец.",
                        "Полить салат оливковым маслом и аккуратно перемешать."
                    ],
                    "ingredients": [
                        {
                            "item": "Огурцы",
                            "amount": "60 г"
                        },
                        {
                            "item": "Помидоры",
                            "amount": "60 г"
                        },
                        {
                            "item": "Брынза",
                            "amount": "30 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "9 г"
                        },
                        {
                            "item": "Базилик",
                            "amount": "2 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "1 г"
                        },
                        {
                            "item": "Черный перец",
                            "amount": "1 г"
                        }
                    ]
                },
                "protein": 7,
                "calories": 180
            },
            {
                "fat": 12,
                "type": "dinner",
                "carbs": 47,
                "title": "Курица в соевом соусе с булгуром и овощами",
                "recipe": {
                    "steps": [
                        "Куриное филе нарезать небольшими кусочками и замариновать в соевом соусе на 15-20 минут.",
                        "Булгур промыть и отварить до готовности в подсоленной воде.",
                        "Лук, морковь и болгарский перец нарезать небольшими кубиками или полосками.",
                        "На сковороде разогреть растительное масло, обжарить лук до прозрачности, добавить морковь и перец, жарить на среднем огне 5 минут.",
                        "Добавить к овощам нарезанный чеснок, жарить еще 2 минуты.",
                        "Затем добавить к овощам маринованное куриное филе, жарить до полной готовности мяса, примерно 10-15 минут, периодически помешивая.",
                        "Смешать готовый булгур с овощами и курицей, тщательно перемешать, приправить солью и перцем по вкусу.",
                        "Подавать горячим."
                    ],
                    "ingredients": [
                        {
                            "item": "Куриное филе",
                            "amount": "101 г"
                        },
                        {
                            "item": "Булгур",
                            "amount": "51 г"
                        },
                        {
                            "item": "Соевый соус",
                            "amount": "15 г"
                        },
                        {
                            "item": "Морковь",
                            "amount": "25 г"
                        },
                        {
                            "item": "Болгарский перец",
                            "amount": "25 г"
                        },
                        {
                            "item": "Лук репчатый",
                            "amount": "25 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "5 г"
                        },
                        {
                            "item": "Растительное масло",
                            "amount": "8 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "1 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "1 г"
                        }
                    ]
                },
                "protein": 39,
                "calories": 450
            }
        ],
        "total": {
            "fat": 110,
            "carbs": 101,
            "protein": 107,
            "calories": 1800
        }
    }
]

export const PUBLIC_ROUTES = ['/login', '/register', '/about', '/terms', '/register', '/learn-more', '/'];

export const MENU_ROUTES = [{
    route: '/menu',
    title: 'Menu',
    icon: faUtensils,
}, {
    route: '/profile',
    title: 'Profile',
    icon: faUser,
}, {
    route: '/groceries',
    title: 'Grocery',
    icon: faPlusCircle,
}, {
    route: '/diary',
    title: 'Diary',
    icon: faPlusCircle,
}, {
    route: '/settings',
    title: 'Settings',
    icon: faPlusCircle,
},
]
export const MORE_ITEMS = [
    {
        href: '/menu',
        icon: faUtensils,
        label: 'Menu',
    },
    {
        href: '/profile',
        icon: faUser,
        label: 'Profile',
    },
    {
        href: '/diary',
        icon: faBook,
        label: 'Food diary',
    },
    {
        href: '/nutrients',
        icon: faTableList,
        label: 'Nutrients',
    },
    {
        href: '/settings',
        icon: faGear,
        label: 'Settings',
    },
    {
        href: '/terms',
        icon: faInfoCircle,
        label: 'Term of Usage',
    },
    {
        href: '/privacy',
        icon: faInfoCircle,
        label: 'Privacy Policy',
    },
];

export const MOBILE_MENU_ROUTES = [
    {
        route: '/',
        title: 'Home',
        icon: faHouse,
    },
    {
        route: '/menu',
        title: 'Menu',
        icon: faUtensils,
    },
    {
        route: '/profile',
        title: 'Profile',
        icon: faUser,
    },
    {
        route: '/diary',
        title: 'Diary',
        icon: faBook,
    },
    {
        route: '/more',
        title: 'More',
        icon: faEllipsisH,
    },
]


export const MEAL_TYPES_OPTIONS = [
    {value: 'breakfast', label: 'Breakfast'},
    {value: 'lunch', label: 'Lunch'},
    {value: 'dinner', label: 'Dinner'},
    {value: 'snack', label: 'Snack'},
    {value: 'afternoon_snack', label: 'Afternoon snack'},
];

export const MEAL_TYPES = {
    breakfast: 'Breakfast',
    lunch: 'Lunch',
    dinner: 'Dinner',
    snack: 'Snack',
    afternoon_snack: 'Afternoon snack',
}