import {
    faBook,
    faEllipsisH,
    faGear,
    faHouse,
    faInfoCircle,
    faPlusCircle,
    faTableList,
    faUser,
    faUtensils
} from "@fortawesome/free-solid-svg-icons";

export const MOCKED_MENU = [
    {
        "day": 1,
        "meals": [
            {
                "fat": 7,
                "type": "breakfast",
                "carbs": 98,
                "title": "Овсянка с фруктами",
                "recipe": {
                    "steps": [
                        "В кастрюлю налить молоко или воду, добавить овсяные хлопья и варить на медленном огне до загустения.",
                        "Пока овсянка варится, нарезать фрукты.",
                        "Добавить нарезанные фрукты и мед в готовую овсянку, перемешать.",
                        "Посыпать корицей перед подачей."
                    ],
                    "ingredients": [
                        {
                            "item": "Овсяные хлопья",
                            "amount": "71 г"
                        },
                        {
                            "item": "Молоко или вода",
                            "amount": "142 г"
                        },
                        {
                            "item": "Яблоко",
                            "amount": "71 г"
                        },
                        {
                            "item": "Банан",
                            "amount": "85 г"
                        },
                        {
                            "item": "Мед",
                            "amount": "14 г"
                        },
                        {
                            "item": "Корица",
                            "amount": "4 г"
                        }
                    ]
                },
                "protein": 18,
                "calories": 500
            },
            {
                "fat": 5,
                "type": "snack",
                "carbs": 23,
                "title": "Греческий йогурт",
                "recipe": {
                    "steps": [
                        "Подогрейте молоко до 85°C, затем охладите до 45°C.",
                        "Добавьте йогуртовые культуры в молоко и тщательно перемешайте.",
                        "Накройте смесь и оставьте в теплом месте на 4-6 часов.",
                        "После загустения йогурт охладите.",
                        "Перелейте йогурт в тканевый мешочек или марлю, оставьте в холодильнике на 12-24 часа для отделения сыворотки.",
                        "Греческий йогурт готов к употреблению."
                    ],
                    "ingredients": [
                        {
                            "item": "Молоко",
                            "amount": "473 г"
                        },
                        {
                            "item": "Живые йогуртовые культуры",
                            "amount": "2 г"
                        }
                    ]
                },
                "protein": 16,
                "calories": 200
            },
            {
                "fat": 19,
                "type": "lunch",
                "carbs": 64,
                "title": "Гречка с курицей",
                "recipe": {
                    "steps": [
                        "Промыть гречневую крупу под проточной водой.",
                        "Нарезать курицу небольшими кусочками.",
                        "Почистить и мелко нарезать лук и морковь.",
                        "Разогреть сковороду, добавить растительное масло и обжарить лук с морковью до мягкости.",
                        "Добавить курицу к овощам и жарить до готовности курицы, примерно 7-10 минут.",
                        "Посолить и поперчить.",
                        "Добавить гречку и воду, довести до кипения.",
                        "Уменьшить огонь, накрыть крышкой и томить до готовности гречки, примерно 20 минут."
                    ],
                    "ingredients": [
                        {
                            "item": "Гречневая крупа",
                            "amount": "78 г"
                        },
                        {
                            "item": "Куриная грудка",
                            "amount": "117 г"
                        },
                        {
                            "item": "Лук репчатый",
                            "amount": "39 г"
                        },
                        {
                            "item": "Морковь",
                            "amount": "39 г"
                        },
                        {
                            "item": "Растительное масло",
                            "amount": "12 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "2 г"
                        },
                        {
                            "item": "Черный перец молотый",
                            "amount": "1 г"
                        },
                        {
                            "item": "Вода",
                            "amount": "235 мл"
                        }
                    ]
                },
                "protein": 48,
                "calories": 600
            },
            {
                "fat": 14,
                "type": "afternoon_snack",
                "carbs": 18,
                "title": "Орехи и сухофрукты",
                "recipe": {
                    "steps": [
                        "Тщательно промойте все сухофрукты и дайте им высохнуть.",
                        "Смешайте орехи и сухофрукты в большой миске.",
                        "Переложите смесь в подходящую емкость для хранения."
                    ],
                    "ingredients": [
                        {
                            "item": "Грецкие орехи",
                            "amount": "6 г"
                        },
                        {
                            "item": "Фундук",
                            "amount": "6 г"
                        },
                        {
                            "item": "Миндаль",
                            "amount": "6 г"
                        },
                        {
                            "item": "Кешью",
                            "amount": "6 г"
                        },
                        {
                            "item": "Изюм",
                            "amount": "6 г"
                        },
                        {
                            "item": "Курага",
                            "amount": "6 г"
                        },
                        {
                            "item": "Чернослив",
                            "amount": "6 г"
                        }
                    ]
                },
                "protein": 5,
                "calories": 200
            },
            {
                "fat": 21,
                "type": "dinner",
                "carbs": 68,
                "title": "Овощное рагу с фасолью",
                "recipe": {
                    "steps": [
                        "Подготовьте ингредиенты: очистите и нарежьте картофель, морковь, лук, баклажаны, кабачки, болгарский перец, помидоры и чеснок.",
                        "Разогрейте в кастрюле растительное масло и обжарьте лук до прозрачности.",
                        "Добавьте морковь и обжаривайте 3 минуты.",
                        "Добавьте картофель, баклажаны и кабачки, обжаривайте ещё 5 минут.",
                        "Добавьте болгарский перец, помидоры, чеснок, соль и перец, тушите под закрытой крышкой 15 минут.",
                        "Добавьте консервированную фасоль и тушите еще 10 минут."
                    ],
                    "ingredients": [
                        {
                            "item": "Картофель",
                            "amount": "126 г"
                        },
                        {
                            "item": "Морковь",
                            "amount": "63 г"
                        },
                        {
                            "item": "Лук",
                            "amount": "63 г"
                        },
                        {
                            "item": "Баклажаны",
                            "amount": "95 г"
                        },
                        {
                            "item": "Кабачки",
                            "amount": "95 г"
                        },
                        {
                            "item": "Перец болгарский",
                            "amount": "63 г"
                        },
                        {
                            "item": "Помидоры",
                            "amount": "126 г"
                        },
                        {
                            "item": "Фасоль (консервированная)",
                            "amount": "95 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "13 г"
                        },
                        {
                            "item": "Растительное масло",
                            "amount": "19 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "3 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "1 г"
                        }
                    ]
                },
                "protein": 14,
                "calories": 500
            }
        ],
        "total": {
            "fat": 66,
            "carbs": 271,
            "protein": 101,
            "calories": 2000
        }
    },
    {
        "day": 2,
        "meals": [
            {
                "fat": 43,
                "type": "breakfast",
                "carbs": 7,
                "title": "Яичница с томатами",
                "recipe": {
                    "steps": [
                        "Нагрейте сковороду и добавьте растительное масло.",
                        "Вымыть и нарезать томаты.",
                        "Обжарьте томаты на сковороде до мягкости.",
                        "Взбейте яйца и добавьте соль и перец.",
                        "Вылейте яйца на томаты и жарьте до готовности, перемешивая."
                    ],
                    "ingredients": [
                        {
                            "item": "Яйца",
                            "amount": "165 г"
                        },
                        {
                            "item": "Томаты",
                            "amount": "124 г"
                        },
                        {
                            "item": "Растительное масло",
                            "amount": "25 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "4 г"
                        },
                        {
                            "item": "Черный перец",
                            "amount": "2 г"
                        }
                    ]
                },
                "protein": 23,
                "calories": 500
            },
            {
                "fat": 1,
                "type": "snack",
                "carbs": 40,
                "title": "Несколько мандаринов",
                "recipe": {
                    "steps": [
                        "Выберите спелые и ароматные мандарины.",
                        "Тщательно вымойте мандарины под проточной водой.",
                        "Обсушите мандарины наружно с помощью бумажного полотенца.",
                        "Аккуратно очистите мандарины от кожуры.",
                        "Разделите мандарины на дольки.",
                        "Удалите из долек все косточки.",
                        "Разложите очищенные дольки на тарелку и подавайте к столу."
                    ],
                    "ingredients": [
                        {
                            "item": "Мандарины",
                            "amount": "300 г"
                        }
                    ]
                },
                "protein": 2,
                "calories": 159
            },
            {
                "fat": 33,
                "type": "lunch",
                "carbs": 18,
                "title": "Салат из тунца",
                "recipe": {
                    "steps": [
                        "Открыть банку с тунцом, слить жидкость.",
                        "Помыть и нарезать огурец, помидоры черри, красный лук и зеленый салат.",
                        "Смешать в большой миске тунец, огурец, помидоры, лук и салат.",
                        "В маленькой емкости смешать оливковое масло, лимонный сок, соль и перец.",
                        "Заправить салат полученной заправкой и перемешать."
                    ],
                    "ingredients": [
                        {
                            "item": "консервированный тунец",
                            "amount": "200 г"
                        },
                        {
                            "item": "свежий огурец",
                            "amount": "100 г"
                        },
                        {
                            "item": "помидоры черри",
                            "amount": "150 г"
                        },
                        {
                            "item": "красный лук",
                            "amount": "50 г"
                        },
                        {
                            "item": "зеленый салат",
                            "amount": "50 г"
                        },
                        {
                            "item": "оливковое масло",
                            "amount": "30 г"
                        },
                        {
                            "item": "лимонный сок",
                            "amount": "20 г"
                        },
                        {
                            "item": "соль",
                            "amount": "5 г"
                        },
                        {
                            "item": "черный перец",
                            "amount": "3 г"
                        }
                    ]
                },
                "protein": 55,
                "calories": 577
            },
            {
                "fat": 11,
                "type": "afternoon_snack",
                "carbs": 17,
                "title": "Кусочек темного шоколада",
                "recipe": {
                    "steps": [
                        "Возьмите кусок темного шоколада весом 100 г",
                        "Наслаждайтесь вкусом"
                    ],
                    "ingredients": [
                        {
                            "item": "Темный шоколад",
                            "amount": "37 г"
                        }
                    ]
                },
                "protein": 2,
                "calories": 200
            },
            {
                "fat": 25,
                "type": "dinner",
                "carbs": 23,
                "title": "Цыпленок запеченный с картофелем",
                "recipe": {
                    "steps": [
                        "Промойте и обсушите цыпленка. Натрите его солью и перцем.",
                        "Очистите картофель и лук, нарежьте их. Чеснок раздавите.",
                        "Смешайте картофель, лук и чеснок с оливковым маслом, солью, перцем и розмарином.",
                        "Положите овощи на дно формы для запекания, сверху разместите цыпленка.",
                        "Запекайте в предварительно разогретой до 180 градусов духовке около 1 часа 30 минут."
                    ],
                    "ingredients": [
                        {
                            "item": "Цыпленок",
                            "amount": "203 г"
                        },
                        {
                            "item": "Картофель",
                            "amount": "108 г"
                        },
                        {
                            "item": "Лук",
                            "amount": "27 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "5 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "7 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "1 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "1 г"
                        },
                        {
                            "item": "Розмарин",
                            "amount": "1 г"
                        }
                    ]
                },
                "protein": 39,
                "calories": 500
            }
        ],
        "total": {
            "fat": 112,
            "carbs": 105,
            "protein": 121,
            "calories": 1936
        }
    },
    {
        "day": 3,
        "meals": [
            {
                "fat": 5,
                "type": "breakfast",
                "carbs": 57,
                "title": "Смузи из спирулины с бананом",
                "recipe": {
                    "steps": [
                        "Положите все ингредиенты в блендер.",
                        "Взбивайте до гладкости и однородности."
                    ],
                    "ingredients": [
                        {
                            "item": "Спирулина в порошке",
                            "amount": "5 г"
                        },
                        {
                            "item": "Банан",
                            "amount": "150 г"
                        },
                        {
                            "item": "Молоко или растительное молоко",
                            "amount": "200 г"
                        },
                        {
                            "item": "Мед или агава",
                            "amount": "15 г"
                        },
                        {
                            "item": "Лед",
                            "amount": "100 г"
                        }
                    ]
                },
                "protein": 11,
                "calories": 294
            },
            {
                "fat": 5,
                "type": "snack",
                "carbs": 23,
                "title": "Кефир",
                "recipe": {
                    "steps": [
                        "Нагрейте молоко до 40 градусов.",
                        "Добавьте закваску и тщательно перемешайте.",
                        "Накройте крышкой и оставьте в теплом месте на 12 часов.",
                        "После загустения поставьте кефир в холодильник на 3 часа перед употреблением."
                    ],
                    "ingredients": [
                        {
                            "item": "Молоко",
                            "amount": "470 г"
                        },
                        {
                            "item": "Закваска для кефира",
                            "amount": "5 г"
                        }
                    ]
                },
                "protein": 16,
                "calories": 200
            },
            {
                "fat": 21,
                "type": "lunch",
                "carbs": 47,
                "title": "Рис с овощами и куриной грудкой",
                "recipe": {
                    "steps": [
                        "Промыть рис и замочить в воде на 30 минут.",
                        "Куриную грудку нарезать небольшими кусочками.",
                        "Очистить и нарезать морковь и лук.",
                        "Болгарский перец нарезать полосками.",
                        "На сковороде разогреть оливковое масло и обжарить лук до прозрачности.",
                        "Добавить курицу к луку и жарить до готовности.",
                        "Добавить морковь и перец, жарить все вместе еще несколько минут.",
                        "Добавить замоченный рис, зеленый горошек, соль и перец, залить подходящим количеством воды.",
                        "Довести до кипения, уменьшить огонь и томить под крышкой до готовности риса."
                    ],
                    "ingredients": [
                        {
                            "item": "Рис",
                            "amount": "100 г"
                        },
                        {
                            "item": "Куриная грудка",
                            "amount": "150 г"
                        },
                        {
                            "item": "Морковь",
                            "amount": "50 г"
                        },
                        {
                            "item": "Лук",
                            "amount": "50 г"
                        },
                        {
                            "item": "Болгарский перец",
                            "amount": "50 г"
                        },
                        {
                            "item": "Зеленый горошек",
                            "amount": "50 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "15 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "2 г"
                        },
                        {
                            "item": "Перец",
                            "amount": "1 г"
                        }
                    ]
                },
                "protein": 53,
                "calories": 600
            },
            {
                "fat": 0,
                "type": "afternoon_snack",
                "carbs": 21,
                "title": "Яблоко",
                "recipe": {
                    "steps": [
                        "Выберите свежее яблоко.",
                        "Вымойте яблоко под проточной водой."
                    ],
                    "ingredients": [
                        {
                            "item": "Яблоко",
                            "amount": "150 г"
                        }
                    ]
                },
                "protein": 0,
                "calories": 78
            },
            {
                "fat": 26,
                "type": "dinner",
                "carbs": 8,
                "title": "Рыба на пару с зеленью",
                "recipe": {
                    "steps": [
                        "Промойте филе рыбы и обсушите бумажным полотенцем.",
                        "Натрите рыбу солью, перцем и соком лимона, оставьте мариноваться на 20 минут.",
                        "Измельчите чеснок и укроп, смешайте с оливковым маслом.",
                        "Поместите рыбу в пароварку, добавьте сверху зеленую смесь.",
                        "Готовьте на пару 15-20 минут или до готовности."
                    ],
                    "ingredients": [
                        {
                            "item": "Филе белой рыбы",
                            "amount": "293 г"
                        },
                        {
                            "item": "Лимон",
                            "amount": "37 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "7 г"
                        },
                        {
                            "item": "Свежий укроп",
                            "amount": "15 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "4 г"
                        },
                        {
                            "item": "Черный перец",
                            "amount": "4 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "22 г"
                        }
                    ]
                },
                "protein": 62,
                "calories": 500
            }
        ],
        "total": {
            "fat": 57,
            "carbs": 156,
            "protein": 143,
            "calories": 1672
        }
    },
    {
        "day": 4,
        "meals": [
            {
                "fat": 7,
                "type": "breakfast",
                "carbs": 103,
                "title": "Каша булгур с ягодами",
                "recipe": {
                    "steps": [
                        "Промойте булгур и залейте его горячей водой, доведите до кипения и варите на медленном огне под крышкой 15-20 минут до готовности.",
                        "Добавьте ягоды и мед к готовому булгур, перемешайте и томите на слабом огне еще 5 минут.",
                        "Подавайте кашу, посыпав сверху слайсами миндаля."
                    ],
                    "ingredients": [
                        {
                            "item": "булгур",
                            "amount": "105 г"
                        },
                        {
                            "item": "вода",
                            "amount": "210 мл"
                        },
                        {
                            "item": "смешанные ягоды (замороженные или свежие)",
                            "amount": "79 г"
                        },
                        {
                            "item": "мед",
                            "amount": "16 г"
                        },
                        {
                            "item": "миндаль (слайсы)",
                            "amount": "10 г"
                        }
                    ]
                },
                "protein": 16,
                "calories": 500
            },
            {
                "fat": 9,
                "type": "snack",
                "carbs": 25,
                "title": "Морковь с хумусом",
                "recipe": {
                    "steps": [
                        "Тщательно вымыть морковь, почистить и нарезать на полоски.",
                        "Разложить морковные полоски на тарелке и добавить рядом хумус для дипа."
                    ],
                    "ingredients": [
                        {
                            "item": "Морковь",
                            "amount": "121 г"
                        },
                        {
                            "item": "Хумус",
                            "amount": "91 г"
                        }
                    ]
                },
                "protein": 8,
                "calories": 200
            },
            {
                "fat": 33,
                "type": "lunch",
                "carbs": 47,
                "title": "Лазанья с говядиной",
                "recipe": {
                    "steps": [
                        "Нарезать лук и морковь, обжарить на оливковом масле до мягкости.",
                        "Добавить говяжий фарш к овощам и жарить до готовности.",
                        "Добавить томатную пасту к фаршу, тушить 10 минут.",
                        "Приготовить бешамель: растопить сливочное масло, добавить муку, обжарить, затем влить молоко, варить до загустения.",
                        "Добавить соль и перец в соус.",
                        "Смазать форму для запекания маслом, выложить слой листов для лазаньи.",
                        "Чередовать слои фарша и бешамеля с листами лазаньи.",
                        "Последний слой покрыть бешамелем и посыпать тертым пармезаном.",
                        "Запекать в предварительно разогретой до 180°C духовке 30 минут."
                    ],
                    "ingredients": [
                        {
                            "item": "листы для лазаньи",
                            "amount": "40 г"
                        },
                        {
                            "item": "говяжий фарш",
                            "amount": "79 г"
                        },
                        {
                            "item": "лук репчатый",
                            "amount": "16 г"
                        },
                        {
                            "item": "морковь",
                            "amount": "16 г"
                        },
                        {
                            "item": "томатная паста",
                            "amount": "24 г"
                        },
                        {
                            "item": "мука пшеничная",
                            "amount": "8 г"
                        },
                        {
                            "item": "молоко",
                            "amount": "79 мл"
                        },
                        {
                            "item": "сыр пармезан",
                            "amount": "16 г"
                        },
                        {
                            "item": "масло сливочное",
                            "amount": "8 г"
                        },
                        {
                            "item": "оливковое масло",
                            "amount": "5 г"
                        },
                        {
                            "item": "соль",
                            "amount": "1 г"
                        },
                        {
                            "item": "перец черный молотый",
                            "amount": "1 г"
                        }
                    ]
                },
                "protein": 30,
                "calories": 600
            },
            {
                "fat": 0,
                "type": "afternoon_snack",
                "carbs": 23,
                "title": "Груша",
                "recipe": {
                    "steps": [
                        "Выберите спелую грушу.",
                        "Промойте грушу под проточной водой."
                    ],
                    "ingredients": [
                        {
                            "item": "Груша",
                            "amount": "150 г"
                        }
                    ]
                },
                "protein": 1,
                "calories": 86
            },
            {
                "fat": 31,
                "type": "dinner",
                "carbs": 23,
                "title": "Тушеная свинина с овощным гарниром",
                "recipe": {
                    "steps": [
                        "Нарезать свинину на куски, посолить, поперчить и обжарить на растительном масле до золотистой корочки.",
                        "Добавить нарезанный лук и чеснок, обжарить до мягкости лука.",
                        "Добавить нарезанные морковь и картофель, томатную пасту, все тщательно перемешать.",
                        "Залить содержимое сковороды овощным бульоном, добавить лавровый лист.",
                        "Тушить под закрытой крышкой на медленном огне до готовности овощей, примерно 40 минут."
                    ],
                    "ingredients": [
                        {
                            "item": "Свинина",
                            "amount": "113 г"
                        },
                        {
                            "item": "Картофель",
                            "amount": "68 г"
                        },
                        {
                            "item": "Морковь",
                            "amount": "45 г"
                        },
                        {
                            "item": "Лук",
                            "amount": "23 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "5 г"
                        },
                        {
                            "item": "Томатная паста",
                            "amount": "11 г"
                        },
                        {
                            "item": "Овощной бульон",
                            "amount": "113 мл"
                        },
                        {
                            "item": "Соль",
                            "amount": "1 г"
                        },
                        {
                            "item": "Перец",
                            "amount": "1 г"
                        },
                        {
                            "item": "Растительное масло",
                            "amount": "7 г"
                        },
                        {
                            "item": "Лавровый лист",
                            "amount": "0 г"
                        }
                    ]
                },
                "protein": 32,
                "calories": 500
            }
        ],
        "total": {
            "fat": 80,
            "carbs": 221,
            "protein": 87,
            "calories": 1886
        }
    },
    {
        "day": 5,
        "meals": [
            {
                "fat": 25,
                "type": "breakfast",
                "carbs": 52,
                "title": "Тосты с авокадо и лососем",
                "recipe": {
                    "steps": [
                        "Подготовьте ингредиенты: хлеб нарежьте ломтиками и поджарьте на гриле или в тостере до золотистой корочки.",
                        "Авокадо очистите от кожуры и косточки, нарежьте мякоть на мелкие кусочки или разомните вилкой до состояния пюре. Добавьте лимонный сок, оливковое масло, соль и перец, хорошо перемешайте.",
                        "На поджаренные ломтики хлеба равномерно распределите смесь авокадо.",
                        "Лосось нарежьте тонкими ломтиками и разложите сверху на авокадо.",
                        "Подавайте сразу после приготовления."
                    ],
                    "ingredients": [
                        {
                            "item": "Хлеб",
                            "amount": "92 г"
                        },
                        {
                            "item": "Авокадо",
                            "amount": "74 г"
                        },
                        {
                            "item": "Лосось",
                            "amount": "46 г"
                        },
                        {
                            "item": "Лимонный сок",
                            "amount": "5 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "5 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "2 г"
                        },
                        {
                            "item": "Перец",
                            "amount": "1 г"
                        }
                    ]
                },
                "protein": 20,
                "calories": 500
            },
            {
                "fat": 2,
                "type": "snack",
                "carbs": 40,
                "title": "Коктейль из молока и банана",
                "recipe": {
                    "steps": [
                        "Поместите банан в блендер и измельчите его до однородной массы.",
                        "Добавьте молоко к банану и взбейте до получения однородной смеси."
                    ],
                    "ingredients": [
                        {
                            "item": "Молоко",
                            "amount": "184 г"
                        },
                        {
                            "item": "Банан",
                            "amount": "138 г"
                        }
                    ]
                },
                "protein": 8,
                "calories": 200
            },
            {
                "fat": 29,
                "type": "lunch",
                "carbs": 35,
                "title": "Курица с карри и рисом",
                "recipe": {
                    "steps": [
                        "Нарезать куриное филе на кусочки. Лук и чеснок мелко нарубить.",
                        "Разогреть сковороду с оливковым маслом и обжарить лук до золотистости, добавить чеснок и курицу, жарить до готовности курицы.",
                        "Добавить карри, перемешать и жарить еще 2 минуты.",
                        "Влить кокосовое молоко, добавить соль и перец. Тушить на медленном огне 10 минут.",
                        "Отдельно сварить рис до готовности.",
                        "Подавать курицу с карри вместе с рисом."
                    ],
                    "ingredients": [
                        {
                            "item": "Куриное филе",
                            "amount": "146 г"
                        },
                        {
                            "item": "Рис",
                            "amount": "87 г"
                        },
                        {
                            "item": "Лук",
                            "amount": "29 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "6 г"
                        },
                        {
                            "item": "Карри",
                            "amount": "4 г"
                        },
                        {
                            "item": "Кокосовое молоко",
                            "amount": "58 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "9 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "1 г"
                        },
                        {
                            "item": "Перец",
                            "amount": "1 г"
                        }
                    ]
                },
                "protein": 50,
                "calories": 600
            },
            {
                "fat": 18,
                "type": "afternoon_snack",
                "carbs": 9,
                "title": "Сельдерей с арахисовым маслом",
                "recipe": {
                    "steps": [
                        "Очистите и нарежьте сельдерей на тонкие полоски.",
                        "В маленькой миске смешайте арахисовое масло, соевый соус, измельченный чеснок, тертый имбирь, мед, лимонный сок и кунжутное масло до однородной консистенции.",
                        "Полейте сельдерей полученной заправкой и тщательно перемешайте.",
                        "Посыпьте блюдо кунжутом перед подачей."
                    ],
                    "ingredients": [
                        {
                            "item": "Сельдерей",
                            "amount": "94 г"
                        },
                        {
                            "item": "Арахисовое масло",
                            "amount": "16 г"
                        },
                        {
                            "item": "Соевый соус",
                            "amount": "6 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "3 г"
                        },
                        {
                            "item": "Имбирь",
                            "amount": "2 г"
                        },
                        {
                            "item": "Мед",
                            "amount": "5 г"
                        },
                        {
                            "item": "Лимонный сок",
                            "amount": "3 г"
                        },
                        {
                            "item": "Кунжутное масло",
                            "amount": "2 г"
                        },
                        {
                            "item": "Кунжут",
                            "amount": "2 г"
                        }
                    ]
                },
                "protein": 2,
                "calories": 200
            },
            {
                "fat": 39,
                "type": "dinner",
                "carbs": 9,
                "title": "Стейк из говядины с салатом из свежих овощей",
                "recipe": {
                    "steps": [
                        "Натереть стейк солью и перцем.",
                        "Разогреть сковороду, добавить оливковое масло и обжарить стейк по 3-5 минут с каждой стороны до желаемой степени прожарки.",
                        "Для салата нарезать помидоры, огурцы, лук и смешать с листьями салата.",
                        "Заправить салат оливковым маслом, лимонным соком, солью и перцем.",
                        "Подавать стейк вместе с салатом."
                    ],
                    "ingredients": [
                        {
                            "item": "Говяжий стейк",
                            "amount": "113 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "3 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "2 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "6 мл"
                        },
                        {
                            "item": "Помидоры",
                            "amount": "57 г"
                        },
                        {
                            "item": "Огурцы",
                            "amount": "57 г"
                        },
                        {
                            "item": "Листья салата",
                            "amount": "28 г"
                        },
                        {
                            "item": "Лук красный",
                            "amount": "28 г"
                        },
                        {
                            "item": "Оливковое масло для заправки",
                            "amount": "11 мл"
                        },
                        {
                            "item": "Лимонный сок",
                            "amount": "6 мл"
                        },
                        {
                            "item": "Соль для салата",
                            "amount": "1 г"
                        },
                        {
                            "item": "Перец черный молотый для салата",
                            "amount": "1 г"
                        }
                    ]
                },
                "protein": 31,
                "calories": 500
            }
        ],
        "total": {
            "fat": 113,
            "carbs": 145,
            "protein": 111,
            "calories": 2000
        }
    },
    {
        "day": 6,
        "meals": [
            {
                "fat": 33,
                "type": "breakfast",
                "carbs": 9,
                "title": "Омлет со шпинатом",
                "recipe": {
                    "steps": [
                        "Промойте и обсушите шпинат.",
                        "На разогретой сковороде с оливковым маслом обжарьте шпинат до мягкости.",
                        "В миске взбейте яйца с молоком, солью и перцем.",
                        "Добавьте яичную смесь к шпинату.",
                        "Готовьте на среднем огне до схватывания яиц, затем аккуратно переверните омлет.",
                        "Готовьте еще несколько минут до готовности."
                    ],
                    "ingredients": [
                        {
                            "item": "Яйца",
                            "amount": "200 г"
                        },
                        {
                            "item": "Шпинат",
                            "amount": "100 г"
                        },
                        {
                            "item": "Молоко",
                            "amount": "50 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "5 г"
                        },
                        {
                            "item": "Черный перец",
                            "amount": "2 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "10 г"
                        }
                    ]
                },
                "protein": 31,
                "calories": 447
            },
            {
                "fat": 16,
                "type": "snack",
                "carbs": 1,
                "title": "Шматок сыра",
                "recipe": {
                    "steps": [
                        "Возьмите шматок сыра весом 100 грамм.",
                        "Подавайте к столу."
                    ],
                    "ingredients": [
                        {
                            "item": "Сыр",
                            "amount": "57 г"
                        }
                    ]
                },
                "protein": 13,
                "calories": 200
            },
            {
                "fat": 37,
                "type": "lunch",
                "carbs": 32,
                "title": "Суп с фрикадельками",
                "recipe": {
                    "steps": [
                        "Налейте в кастрюлю воду и доведите до кипения.",
                        "Добавьте соль, перец и лавровый лист.",
                        "В миске смешайте фарш, мелко нарезанный лук, рис, соль и перец по вкусу.",
                        "Сформируйте из фарша небольшие фрикадельки.",
                        "Опустите фрикадельки в кипящий бульон.",
                        "Через 10 минут добавьте нарезанный кубиками картофель и морковь.",
                        "Варите суп до готовности всех ингредиентов.",
                        "Перед подачей добавьте мелко нарезанную зелень."
                    ],
                    "ingredients": [
                        {
                            "item": "Вода",
                            "amount": "539 г"
                        },
                        {
                            "item": "Фарш мясной",
                            "amount": "180 г"
                        },
                        {
                            "item": "Рис",
                            "amount": "18 г"
                        },
                        {
                            "item": "Лук",
                            "amount": "36 г"
                        },
                        {
                            "item": "Морковь",
                            "amount": "36 г"
                        },
                        {
                            "item": "Картофель",
                            "amount": "108 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "4 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "2 г"
                        },
                        {
                            "item": "Лавровый лист",
                            "amount": "0 г"
                        },
                        {
                            "item": "Зелень",
                            "amount": "11 г"
                        }
                    ]
                },
                "protein": 38,
                "calories": 600
            },
            {
                "fat": 5,
                "type": "afternoon_snack",
                "carbs": 35,
                "title": "Клубничный йогурт",
                "recipe": {
                    "steps": [
                        "Тщательно вымойте клубнику, удалите хвостики и нарежьте на мелкие кусочки.",
                        "В блендере смешайте клубнику, йогурт и мед до однородной консистенции.",
                        "Перелейте полученный йогурт в стаканы и охладите перед подачей."
                    ],
                    "ingredients": [
                        {
                            "item": "Клубника",
                            "amount": "188 г"
                        },
                        {
                            "item": "Натуральный йогурт",
                            "amount": "141 г"
                        },
                        {
                            "item": "Мед",
                            "amount": "19 г"
                        }
                    ]
                },
                "protein": 8,
                "calories": 200
            },
            {
                "fat": 38,
                "type": "dinner",
                "carbs": 15,
                "title": "Утка с яблочным соусом и булгур",
                "recipe": {
                    "steps": [
                        "Утку тщательно вымыть, обсушить, посолить и поперчить.",
                        "Подготовить овощи: очистить и мелко нарезать лук, морковь и сельдерей.",
                        "В кастрюле растопить сливочное масло, обжарить на нем подготовленные овощи до золотистого цвета.",
                        "Добавить к овощам утку, залить небольшим количеством воды и тушить под крышкой на медленном огне 1,5 часа.",
                        "Яблоки очистить от кожуры и сердцевины, нарезать дольками, засыпать сахаром и добавить бальзамический уксус.",
                        "Тушить яблоки на медленном огне до состояния пюре.",
                        "Булгур промыть, залить водой и варить до готовности около 15 минут.",
                        "Утку вынуть, разделить на порционные куски.",
                        "На тарелку выложить готовый булгур, рядом утку и полить все яблочным соусом."
                    ],
                    "ingredients": [
                        {
                            "item": "Утка",
                            "amount": "123 г"
                        },
                        {
                            "item": "Яблоки",
                            "amount": "18 г"
                        },
                        {
                            "item": "Булгур",
                            "amount": "12 г"
                        },
                        {
                            "item": "Лук",
                            "amount": "6 г"
                        },
                        {
                            "item": "Морковь",
                            "amount": "6 г"
                        },
                        {
                            "item": "Сельдерей",
                            "amount": "6 г"
                        },
                        {
                            "item": "Сливочное масло",
                            "amount": "3 г"
                        },
                        {
                            "item": "Сахар",
                            "amount": "1 г"
                        },
                        {
                            "item": "Уксус бальзамический",
                            "amount": "1 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "1 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "0 г"
                        }
                    ]
                },
                "protein": 25,
                "calories": 500
            }
        ],
        "total": {
            "fat": 129,
            "carbs": 92,
            "protein": 115,
            "calories": 1947
        }
    },
    {
        "day": 7,
        "meals": [
            {
                "fat": 25,
                "type": "breakfast",
                "carbs": 61,
                "title": "Каша из киноа с медом и орехами",
                "recipe": {
                    "steps": [
                        "Промыть киноа под проточной водой.",
                        "Залить киноа водой и довести до кипения, затем варить на медленном огне 15 минут.",
                        "Добавить мед и перемешать.",
                        "Посыпать кашу измельченными грецкими орехами перед подачей."
                    ],
                    "ingredients": [
                        {
                            "item": "Киноа",
                            "amount": "64 г"
                        },
                        {
                            "item": "Мед",
                            "amount": "19 г"
                        },
                        {
                            "item": "Грецкие орехи",
                            "amount": "32 г"
                        },
                        {
                            "item": "Вода",
                            "amount": "127 мл"
                        }
                    ]
                },
                "protein": 14,
                "calories": 500
            },
            {
                "fat": 1,
                "type": "snack",
                "carbs": 52,
                "title": "Фруктовый салат",
                "recipe": {
                    "steps": [
                        "Помыть и очистить все фрукты.",
                        "Нарезать фрукты на небольшие кусочки.",
                        "Смешать фрукты в большой миске.",
                        "Добавить мед и лимонный сок.",
                        "Аккуратно перемешать салат."
                    ],
                    "ingredients": [
                        {
                            "item": "Яблоко",
                            "amount": "69 г"
                        },
                        {
                            "item": "Банан",
                            "amount": "52 г"
                        },
                        {
                            "item": "Киви",
                            "amount": "35 г"
                        },
                        {
                            "item": "Апельсин",
                            "amount": "52 г"
                        },
                        {
                            "item": "Ягоды (любые на выбор)",
                            "amount": "35 г"
                        },
                        {
                            "item": "Мед",
                            "amount": "17 г"
                        },
                        {
                            "item": "Лимонный сок",
                            "amount": "10 г"
                        }
                    ]
                },
                "protein": 2,
                "calories": 200
            },
            {
                "fat": 35,
                "type": "lunch",
                "carbs": 33,
                "title": "Бефстроганов с пюре",
                "recipe": {
                    "steps": [
                        "Нарезать говядину тонкими полосками и обжарить до золотистой корочки.",
                        "Добавить нарезанный лук и жарить до мягкости лука.",
                        "Посыпать мукой, перемешать и обжарить еще несколько минут.",
                        "Добавить сметану, горчицу, соль и перец, тушить на медленном огне 10-15 минут.",
                        "Для пюре: отварить картофель, размять в пюре, добавить сливочное масло, молоко, соль и тщательно перемешать."
                    ],
                    "ingredients": [
                        {
                            "item": "Говядина",
                            "amount": "110 г"
                        },
                        {
                            "item": "Лук репчатый",
                            "amount": "22 г"
                        },
                        {
                            "item": "Мука пшеничная",
                            "amount": "7 г"
                        },
                        {
                            "item": "Масло сливочное",
                            "amount": "11 г"
                        },
                        {
                            "item": "Сметана",
                            "amount": "44 г"
                        },
                        {
                            "item": "Горчица",
                            "amount": "4 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "1 г"
                        },
                        {
                            "item": "Перец черный молотый",
                            "amount": "1 г"
                        },
                        {
                            "item": "Картофель",
                            "amount": "132 г"
                        },
                        {
                            "item": "Молоко",
                            "amount": "22 г"
                        }
                    ]
                },
                "protein": 34,
                "calories": 600
            },
            {
                "fat": 1,
                "type": "afternoon_snack",
                "carbs": 50,
                "title": "Смузи из киви и шпината",
                "recipe": {
                    "steps": [
                        "Очистите киви и банан, нарежьте их на кусочки.",
                        "Поместите киви, банан, шпинат, мед и воду (или яблочный сок) в блендер.",
                        "Взбейте до однородной консистенции.",
                        "Перелейте смузи в стаканы и подавайте."
                    ],
                    "ingredients": [
                        {
                            "item": "Киви",
                            "amount": "123 г"
                        },
                        {
                            "item": "Шпинат",
                            "amount": "18 г"
                        },
                        {
                            "item": "Банан",
                            "amount": "62 г"
                        },
                        {
                            "item": "Мед",
                            "amount": "12 г"
                        },
                        {
                            "item": "Вода или яблочный сок",
                            "amount": "62 г"
                        }
                    ]
                },
                "protein": 3,
                "calories": 200
            },
            {
                "fat": 22,
                "type": "dinner",
                "carbs": 61,
                "title": "Паста с баклажанами и помидорами",
                "recipe": {
                    "steps": [
                        "Нарезать баклажаны кубиками и подсолить, оставить на 20 минут, затем обжарить на оливковом масле до золотистой корочки.",
                        "Отварить спагетти до состояния аль денте в подсоленной воде.",
                        "Нарезать помидоры кубиками, чеснок мелко нарубить.",
                        "На сковороде с оливковым маслом обжарить чеснок, добавить помидоры, тушить 5 минут.",
                        "Добавить в сковороду к помидорам обжаренные баклажаны, тушить еще 5 минут.",
                        "Добавить спагетти к овощам, перемешать, посолить и поперчить по вкусу.",
                        "Подавать, посыпав свежим нарубленным базиликом и тертым пармезаном."
                    ],
                    "ingredients": [
                        {
                            "item": "Спагетти",
                            "amount": "157 г"
                        },
                        {
                            "item": "Баклажаны",
                            "amount": "105 г"
                        },
                        {
                            "item": "Помидоры",
                            "amount": "79 г"
                        },
                        {
                            "item": "Чеснок",
                            "amount": "5 г"
                        },
                        {
                            "item": "Оливковое масло",
                            "amount": "16 г"
                        },
                        {
                            "item": "Соль",
                            "amount": "3 г"
                        },
                        {
                            "item": "Перец чёрный молотый",
                            "amount": "1 г"
                        },
                        {
                            "item": "Базилик",
                            "amount": "3 г"
                        },
                        {
                            "item": "Сыр пармезан",
                            "amount": "16 г"
                        }
                    ]
                },
                "protein": 17,
                "calories": 500
            }
        ],
        "total": {
            "fat": 84,
            "carbs": 257,
            "protein": 70,
            "calories": 2000
        }
    }
]

export const PUBLIC_ROUTES = ['/login', '/register', '/about', '/terms', '/register', '/learn-more', '/'];

export const MENU_ROUTES = [
    {
        route: '/menu',
        title: 'Menu',
        icon: faUtensils,
    },
    {
        route: '/profile',
        title: 'Profile',
        icon: faUser,
    },
    {
        route: '/groceries',
        title: 'Grocery',
        icon: faPlusCircle,
    },
    {
        route: '/diary',
        title: 'Diary',
        icon: faPlusCircle,
    },
    {
        route: '/nutrients',
        title: 'Nutrients',
        icon: faPlusCircle,
    },
    {
        route: '/settings',
        title: 'Settings',
        icon: faPlusCircle,
    },
]
export const MORE_ITEMS = [
    {
        href: '/menu',
        icon: faUtensils,
        label: 'Menu',
    },
    {
        href: '/profile',
        icon: faUser,
        label: 'Profile',
    },
    {
        href: '/diary',
        icon: faBook,
        label: 'Food diary',
    },
    {
        href: '/nutrients',
        icon: faTableList,
        label: 'Nutrients',
    },
    {
        href: '/settings',
        icon: faGear,
        label: 'Settings',
    },
    {
        href: '/terms',
        icon: faInfoCircle,
        label: 'Term of Usage',
    },
    {
        href: '/privacy',
        icon: faInfoCircle,
        label: 'Privacy Policy',
    },
];

export const MOBILE_MENU_ROUTES = [
    {
        route: '/',
        title: 'Home',
        icon: faHouse,
    },
    {
        route: '/menu',
        title: 'Menu',
        icon: faUtensils,
    },
    {
        route: '/nutrients',
        title: 'Nutrients',
        icon: faTableList,
    },
    {
        route: '/diary',
        title: 'Diary',
        icon: faBook,
    },
    {
        route: '/more',
        title: 'More',
        icon: faEllipsisH,
    },
]


export const MEAL_TYPES_OPTIONS = [
    {value: 'breakfast', label: 'Breakfast'},
    {value: 'lunch', label: 'Lunch'},
    {value: 'dinner', label: 'Dinner'},
    {value: 'snack', label: 'Snack'},
    {value: 'afternoon_snack', label: 'Afternoon snack'},
];

export const MEAL_TYPES = {
    breakfast: 'Breakfast',
    lunch: 'Lunch',
    dinner: 'Dinner',
    snack: 'Snack',
    afternoon_snack: 'Afternoon snack',
}